[
    {   
        "project_category":"resrunt",
        "project_name": "Bisto Boss",
        "project_sort_discription": "Bisto Boss is a dynamic restaurant management application offering a seamless food ordering experience, integrated payment methods, and user-specific dashboards for both customers and administrators.",
        "frist_commit": "21 May 2024",
        "project_long_discription": "Bisto Boss is a comprehensive restaurant management platform designed to enhance the dining experience through technology. This project encompasses a variety of features, including a streamlined food ordering system, secure payment processing via Stripe, and user authentication through Google login. The platform provides distinct dashboards for users and administrators, facilitating efficient order management, user role assignments, and overall restaurant operations. Built with modern technologies such as HTML, CSS, Tailwind, React, MongoDB, Express, Firebase, Axios, and TanStack, Bisto Boss aims to deliver a robust and user-friendly solution for restaurant businesses.",
        "homepage_img": "https://i.ibb.co/zF6BzcH/screencapture-localhost-5173-2024-07-11-12-24-32.png",
        "live_link": "",
        "ficture": [
            "payment methord (stripe)","user and admin roll", "Log in with google","food orders","user and admin dashbord"
        ],
        "repository_link": "https://github.com/ABidhasan134/boss-restaurant-clinte.git",
        "project_motivation":"The motivation behind Bisto Boss is to leverage modern web technologies to streamline restaurant operations, enhance the customer experience, and provide robust management tools for restaurant administrators.",
        "tecnology_use": [
            "html","css","tailwind","React", "mongodb","express","firebase", "axios", "tanstack"
        ]
        
    },
    {   
        "project_category":"food donations",
        "project_name": "Food Valley",
        "project_sort_discription": "Food Valley is an innovative platform dedicated to facilitating food donations. It offers features such as Google login, food donation management, food item addition and updates, and powerful search and sorting capabilities.",
        "frist_commit": "21 May 2024",
        "project_long_discription": "Food Valley is a dedicated food donation management platform designed to streamline the process of donating and managing food items. The platform allows users to log in with their Google accounts, making the authentication process quick and easy. Users can donate food, add new food items, update existing ones, and utilize advanced search and sorting functions to find exactly what they need. The application is built using modern web technologies, ensuring a smooth and efficient user experience. Technologies utilized include HTML, CSS, Tailwind, React for the frontend, and Express, MongoDB for the backend. Firebase is used for authentication and hosting, while Axios and TanStack handle API and state management.",
        "homepage_img": "https://i.ibb.co/M2Q92cH/screencapture-localhost-5173-2024-07-11-12-34-09.png",
        "live_link": "https://realstate-property-assinment.web.app/",
        "ficture": [
            "Log in with google","food donaton", "Add food", "update food","search and sort as you need"
        ],
        "repository_link": "https://github.com/ABidhasan134/food-vally-clinte-a11.git",
        "project_motivation":"The motivation behind Food Valley is to harness modern web technologies to create an efficient platform for food donation management, making it easier for people to contribute and manage food donations.",
        "tecnology_use": [
            "html","css","tailwind","React", "mongodb","express","firebase", "axios"
        ]
        
    },
    {   
        "project_category":"Travel",
        "project_name": "Life on",
        "project_sort_discription": "Life On is a comprehensive travel management platform featuring Google login, user role management (user, admin, guide), and functionalities to add and update user information, enhancing the travel experience for all users.",
        "frist_commit": "21 May 2024",
        "project_long_discription": "Life On is an innovative travel management platform designed to streamline travel planning and management. The platform offers user authentication through Google login, ensuring a quick and secure sign-in process. It allows users to add and update their information, making it easy to manage travel-related data. Life On also supports role-based access control, differentiating between users, admins, and guides to provide tailored functionalities for each role. Built using modern web technologies, Life On ensures a seamless and efficient user experience. Technologies employed include HTML, CSS, Tailwind, and React for the frontend, with Express and MongoDB handling the backend. Firebase is utilized for authentication and hosting, while Axios and TanStack manage API interactions and state.",
        "homepage_img": "https://i.ibb.co/4Fz01X7/screencapture-localhost-5173-2024-07-11-12-44-12.png",
        "live_link": " https://life-on-tour.web.app",
        "ficture": [
            "Log in with google","food donaton", "Add user", "update user as gude","diffrent there rolles user, admin and guide"
        ],
        "repository_link": "https://github.com/ABidhasan134/lifeon_tour_clinte.git",
        "project_motivation":"The motivation behind Life On is to use modern web technologies to create a user-friendly platform that simplifies travel management and enhances the travel experience through efficient data management and role-specific functionalities.",
        "tecnology_use": [
            "html","css","tailwind","React", "mongodb","express","firebase", "axios","tanstack"
        ]
        
    }
]